### Вариант 2

Вам необходимо реализовать некоторое количество классов оружий которые 
будут тестироваться пользователем на стрельбище с целью его подбора. 
При этом:

- У каждого оружия есть свой магазин и вариант его перезарядки 
  со своим временем требуемым на его перезарядку
пистолет перезаряжается быстро, простым изъятием магазина и вставкой нового
дробовики и винтовки со съемными магазинами перезаряжаются подобно пистолетам
однозарядная винтовка, перезаряжается по 1 патрону
помповый дробовик имеет несъемный магазин и поэтому перезаряжается 
по 1 патрону до заполнения всего магазина

- Каждое оружие имеет следующие характеристики:  
  как калибр, количество патронов, количество режимов стрельбы, 
  вес, прицельная дальность стрельбы, отдельные экземпляры кучность стрельбы, 
  количество устанавливаемых модификаций.

- Шанс попадания по мишени зависит исключительно от расстояния до нее 
  и характеристик самого оружия, 
  так дробовик имеет практически 0 вероятность попасть в мишень в полукилометре, 
  пистолет на том же расстоянии имеет незначительный шанс попадания, 
  штурмовая винтовка средние шансы, 
  а снайперская винтовка очень приличные шансы. 
  В итоге шанс зависит от прицельной дальности стрельбы конкретного оружия. 
  Формулу расчета шанса попадания требуется придумать, 
  так чтобы она описывалась графиком в котором точка максимальной прицельной
  дальности стрельбы соответствовала бы 100% шансу попадания из этого оружия, 
  а дальше резко падала в зависимости от расстояния,  
  для этого можно использовать обратную экспоненты, 
  для которой точка 0.1 будет прицельной дальностью, 
  а дальше будет резко падать но никогда не приблизится к 0.


- Любое оружие должно предоставлять следующие методы:
  - Зарядка магазина, 
    на вход принимается количество патронов на выходе выдается время зарядки, 
    при этом количество патроном не должно превышать максимальный объем магазина, 
    но может быть меньше.
  - Стрельба по мишени одним из режимов стрельбы, 
    при этом оружие на вход получает мишень, 
    а на выходе выдает количество попаданий по цели
  - Вывод характеристик оружия

Требуется:
1. Реализовать класс стрельбища на котором будет находится оружие 
    и мишени одного типа на разном расстоянии от стрелка.

2. Реализовать интерфейсный или абстрактный класс оружия и 
    несколько его конечных вариантов.

3. (На половину баллов) Продемонстрировать работу стрельбища и оружий.

4. (Усложненный вариант) Провести симуляцию проверки работоспособности оружия 
    стрелком, при проверки работоспособности оружия, требуется 
    вывести информацию о нем, 
    а также провести стрельбы на все расстояния, по каждой мишени 
    требуется совершить по 100 выстрелов 
    и замерить среднюю скорострельность в минуту
    (с учетом времени перезарядки на все выстрелы) и 
    точность на каждое из доступных расстояний мишеней. 

5. (Усложненный вариант) В конце симуляции вывести собранную статистику 
  по всем оружиям.
